# Instance Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Instance Class
Members See Also
---
The base class for all instance objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Instance : Element
```

Visual Basic
---
```text
Public Class Instance _
	Inherits Element
```

Visual C++
---
```text
public ref class Instance : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..Instance Autodesk.Revit.DB..::..FamilyInstance Autodesk.Revit.DB..::..ImportInstance Autodesk.Revit.DB..::..PointCloudInstance Autodesk.Revit.DB..::..ProjectLocation Autodesk.Revit.DB..::..RevitLinkInstance
# See Also
Instance Members
Autodesk.Revit.DB Namespace